Autodesk.Revit.DB.Mechanical.SpaceTag.SpaceTagType
The tag type.

Autodesk.Revit.DB.Mechanical.SpaceTag.Space
The space that the tag is associated with.
Remarks: In rare cases, the tag may not be associated to a space.  The property will
be null in these situations.

Autodesk.Revit.DB.Mechanical.SpaceTag
Provides access to the space tag in Autodesk Revit.
Remarks: The space Tag object can be queried for space information.